// ************************************************************************ //
//  警告                                                                      
// ------                                                                     
// このファイルで定義されている型宣言はタイプライブラリから読み出した       //
// 値を元に作成されています。タイプライブラリエディタで作業中に [ソー       //
// スコードの更新] ボタンを押したときや，ほかのタイプライブラリが直接       //
// または間接にこのタイプライブラリを参照している場合に，このファイル       //
// はタイプライブラリの値を元に再生成されます。                             //
// この場合，このファイル自身に対する変更は失われてしまいます。             //
// ************************************************************************ //

// C++ TLBWRTR : $Revision:   1.151.1.0.1.27  $
// このファイルは以下のタイプライブラリから 2024/06/18 22:26:54 に生成されました。

// ************************************************************************  //
// Type Lib: C:\Source\module\ppxscr\PPxScr.tlb (1)
// LIBID: {605CC4A1-BC99-44BC-A9A7-F2C1EF6FC943}
// LCID: 0
// Helpfile: 
// HelpString: PPx Script Module
// DepndLst: 
//   (1) v2.0 stdole, (C:\WINDOWS\System32\stdole2.tlb)
// ************************************************************************ //

#include <vcl.h>
#pragma hdrstop

#include "PPxScr_TLB.h"

#if !defined(__PRAGMA_PACKAGE_SMART_INIT)
#define      __PRAGMA_PACKAGE_SMART_INIT
#pragma package(smart_init)
#endif

namespace Ppxscr_tlb
{


// *********************************************************************//
// タイプライブラリ中の GUID の定義。                                     
// *********************************************************************//
//*********************************************************************//
// NOTE: This file is no longer used. GUIDS previously defined in this 
// file are now defined in the header itself, using __declspec(selectany).
//********************************************************************//

};     // namespace Ppxscr_tlb
